---
kind: method
id: M:Autodesk.Revit.DB.SubTransaction.GetStatus
source: html/3da7e561-66d4-97d5-ed12-7ff77b478421.htm
---
# Autodesk.Revit.DB.SubTransaction.GetStatus Method

Returns the current status of the sub-transaction.

## Syntax (C#)
```csharp
public TransactionStatus GetStatus()
```

## Returns
The current status of the sub-transaction.